"""Необхідно створити функцію generator_numbers, яка буде аналізувати текст, ідентифікувати всі дійсні числа, що вважаються частинами доходів, і повертати їх як генератор. Дійсні числа у тексті записані без помилок, чітко відокремлені пробілами з обох боків. Також потрібно реалізувати функцію sum_profit, яка буде використовувати generator_numbers для підсумовування цих чисел і обчислення загального прибутку.



Вимоги до завдання:

Функція generator_numbers(text: str) повинна приймати рядок як аргумент і повертати генератор, що ітерує по всіх дійсних числах у тексті. Дійсні числа у тексті вважаються записаними без помилок і чітко відокремлені пробілами з обох боків.
Функція sum_profit(text: str, func: Callable) має використовувати генератор generator_numbers для обчислення загальної суми чисел у вхідному рядку та приймати його як аргумент при виклику.
"""

"""Требования к заданию:

Функция generator_numbers(text: str)должна принимать строку как аргумент и возвращать итерирующий генератор по всем действительным числам в тексте. Действительные числа в тексте считаются записанными без ошибок и четко разделены пробелами по обе стороны.
Функция sum_profit(text: str, func: Callable)должна использовать генератор generator_numbersдля вычисления общей суммы чисел во входной строке и принимать его в качестве аргумента при вызове.


Рекомендации для выполнения:

Используйте регулярные выражения для идентификации действительных чисел в тексте с учетом того, что числа четко разделены пробелами.
Используйте yieldфункцию generator_numbersдля создания генератора.
Убедитесь, что sum_profitкорректно обрабатывает данные generator_numbersи суммирует все числа.


Критерии оценки:

Правильность определения и возврата действительных чисел функцией generator_numbers.
Корректность исчисления общей суммы в sum_profit.
Чистота кода, наличие комментариев и соответствие стилю PEP8.


Пример использования:

text = "Общий доход работника состоит из нескольких частей: 1000.01 как основной доход, дополненный дополнительными поступлениями 27.45 и 324.00 долларов." 
total_income = sum_profit ( text , generator_numbers)
 print (f "Общий доход: {total_income}" )



Ожидаемый вывод:

Общий доход :  1351.46"""
